RIOT-OS/RIOT/cpu/sam0_common/include/vendor/saml21/include/compat_saml21a.h
#define TAL_INTFLAG_BRK_Msk (_U_(0x1) << TAL_INTFLAG_BRK_Pos)
#define TAL_GLOBMASK_CM0P_Msk (_U_(0x1) << TAL_GLOBMASK_CM0P_Pos)
#define TAL_GLOBMASK_PPP_Msk (_U_(0x1) << TAL_GLOBMASK_PPP_Pos)
#define TAL_GLOBMASK_EVBRK_Msk (_U_(0x1) << TAL_GLOBMASK_EVBRK_Pos)
#define TAL_GLOBMASK_EXTBRK_Msk (_U_(0x1) << TAL_GLOBMASK_EXTBRK_Pos)
#define TAL_HALT_CM0P_Msk (_U_(0x1) << TAL_HALT_CM0P_Pos)
#define TAL_HALT_PPP_Msk (_U_(0x1) << TAL_HALT_PPP_Pos)
#define TAL_HALT_EVBRK_Msk (_U_(0x1) << TAL_HALT_EVBRK_Pos)
#define TAL_HALT_EXTBRK_Msk (_U_(0x1) << TAL_HALT_EXTBRK_Pos)
#define TAL_RESTART_CM0P_Msk (_U_(0x1) << TAL_RESTART_CM0P_Pos)
#define TAL_RESTART_PPP_Msk (_U_(0x1) << TAL_RESTART_PPP_Pos)
#define TAL_RESTART_EXTBRK_Msk (_U_(0x1) << TAL_RESTART_EXTBRK_Pos)
#define TAL_CTICTRLA_RESTART_Msk (_U_(0x1) << TAL_CTICTRLA_RESTART_Pos)
#define TAL_CTIMASK_CM0P_Msk (_U_(0x1) << TAL_CTIMASK_CM0P_Pos)
#define TAL_CTIMASK_PPP_Msk (_U_(0x1) << TAL_CTIMASK_PPP_Pos)
#define TAL_CTIMASK_EVBRK_Msk (_U_(0x1) << TAL_CTIMASK_EVBRK_Pos)
#define TAL_CTIMASK_EXTBRK_Msk (_U_(0x1) << TAL_CTIMASK_EXTBRK_Pos)
#define TAL_INTSTATUS_IRQ0_Msk (_U_(0x1) << TAL_INTSTATUS_IRQ0_Pos)
#define TAL_INTSTATUS_IRQ1_Msk (_U_(0x1) << TAL_INTSTATUS_IRQ1_Pos)
#define TAL_INTSTATUS_IRQ2_Msk (_U_(0x1) << TAL_INTSTATUS_IRQ2_Pos)
#define TAL_INTSTATUS_IRQ3_Msk (_U_(0x1) << TAL_INTSTATUS_IRQ3_Pos)
#define TAL_INTSTATUS_IRQ4_Msk (_U_(0x1) << TAL_INTSTATUS_IRQ4_Pos)
#define TAL_INTSTATUS_IRQ5_Msk (_U_(0x1) << TAL_INTSTATUS_IRQ5_Pos)
#define TAL_INTSTATUS_IRQ6_Msk (_U_(0x1) << TAL_INTSTATUS_IRQ6_Pos)
#define TAL_INTSTATUS_IRQ7_Msk (_U_(0x1) << TAL_INTSTATUS_IRQ7_Pos)
#define TAL_IRQTRIG_ENABLE_Msk (_U_(0x1) << TAL_IRQTRIG_ENABLE_Pos)
#define TAL_CTRLA_Msk TAL_CTRLA_MASK
#define TAL_RSTCTRL_Msk TAL_RSTCTRL_MASK
#define TAL_EXTCTRL_Msk TAL_EXTCTRL_MASK
#define TAL_EVCTRL_Msk TAL_EVCTRL_MASK
#define TAL_INTENCLR_Msk TAL_INTENCLR_MASK
#define TAL_INTENSET_Msk TAL_INTENSET_MASK
#define TAL_INTFLAG_Msk TAL_INTFLAG_MASK
#define TAL_GLOBMASK_Msk TAL_GLOBMASK_MASK
#define TAL_HALT_Msk TAL_HALT_MASK
#define TAL_RESTART_Msk TAL_RESTART_MASK
#define TAL_BRKSTATUS_Msk TAL_BRKSTATUS_MASK
#define TAL_CTICTRLA_Msk TAL_CTICTRLA_MASK
#define TAL_CTIMASK_Msk TAL_CTIMASK_MASK
#define TAL_INTSTATUS_Msk TAL_INTSTATUS_MASK
#define TAL_DMACPUSEL0_Msk TAL_DMACPUSEL0_MASK
#define TAL_EVCPUSEL0_Msk TAL_EVCPUSEL0_MASK
#define TAL_EICCPUSEL0_Msk TAL_EICCPUSEL0_MASK
#define TAL_INTCPUSEL0_Msk TAL_INTCPUSEL0_MASK
#define TAL_INTCPUSEL1_Msk TAL_INTCPUSEL1_MASK
#define TAL_IRQTRIG_Msk TAL_IRQTRIG_MASK
#define TAL_CPUIRQS_Msk TAL_CPUIRQS_MASK
#define TC_CTRLA_SWRST_Msk (_U_(0x1) << TC_CTRLA_SWRST_Pos)
#define TC_CTRLA_ENABLE_Msk (_U_(0x1) << TC_CTRLA_ENABLE_Pos)
#define TC_CTRLA_RUNSTDBY_Msk (_U_(0x1) << TC_CTRLA_RUNSTDBY_Pos)
#define TC_CTRLA_ONDEMAND_Msk (_U_(0x1) << TC_CTRLA_ONDEMAND_Pos)
#define TC_CTRLA_ALOCK_Msk (_U_(0x1) << TC_CTRLA_ALOCK_Pos)
#define TC_CTRLA_CAPTEN0_Msk (_U_(0x1) << TC_CTRLA_CAPTEN0_Pos)
#define TC_CTRLA_CAPTEN1_Msk (_U_(0x1) << TC_CTRLA_CAPTEN1_Pos)
#define TC_CTRLA_COPEN0_Msk (_U_(0x1) << TC_CTRLA_COPEN0_Pos)
#define TC_CTRLA_COPEN1_Msk (_U_(0x1) << TC_CTRLA_COPEN1_Pos)
#define TC_CTRLBCLR_DIR_Msk (_U_(0x1) << TC_CTRLBCLR_DIR_Pos)
#define TC_CTRLBCLR_LUPD_Msk (_U_(0x1) << TC_CTRLBCLR_LUPD_Pos)
#define TC_CTRLBCLR_ONESHOT_Msk (_U_(0x1) << TC_CTRLBCLR_ONESHOT_Pos)
#define TC_CTRLBSET_DIR_Msk (_U_(0x1) << TC_CTRLBSET_DIR_Pos)
#define TC_CTRLBSET_LUPD_Msk (_U_(0x1) << TC_CTRLBSET_LUPD_Pos)
#define TC_CTRLBSET_ONESHOT_Msk (_U_(0x1) << TC_CTRLBSET_ONESHOT_Pos)
#define TC_EVCTRL_TCINV_Msk (_U_(0x1) << TC_EVCTRL_TCINV_Pos)
#define TC_EVCTRL_TCEI_Msk (_U_(0x1) << TC_EVCTRL_TCEI_Pos)
#define TC_EVCTRL_OVFEO_Msk (_U_(0x1) << TC_EVCTRL_OVFEO_Pos)
#define TC_EVCTRL_MCEO0_Msk (_U_(0x1) << TC_EVCTRL_MCEO0_Pos)
#define TC_EVCTRL_MCEO1_Msk (_U_(0x1) << TC_EVCTRL_MCEO1_Pos)
#define TC_INTENCLR_OVF_Msk (_U_(0x1) << TC_INTENCLR_OVF_Pos)
#define TC_INTENCLR_ERR_Msk (_U_(0x1) << TC_INTENCLR_ERR_Pos)
#define TC_INTENCLR_MC0_Msk (_U_(0x1) << TC_INTENCLR_MC0_Pos)
#define TC_INTENCLR_MC1_Msk (_U_(0x1) << TC_INTENCLR_MC1_Pos)
#define TC_INTENSET_OVF_Msk (_U_(0x1) << TC_INTENSET_OVF_Pos)
#define TC_INTENSET_ERR_Msk (_U_(0x1) << TC_INTENSET_ERR_Pos)
#define TC_INTENSET_MC0_Msk (_U_(0x1) << TC_INTENSET_MC0_Pos)
#define TC_INTENSET_MC1_Msk (_U_(0x1) << TC_INTENSET_MC1_Pos)
#define TC_INTFLAG_OVF_Msk (_U_(0x1) << TC_INTFLAG_OVF_Pos)
#define TC_INTFLAG_ERR_Msk (_U_(0x1) << TC_INTFLAG_ERR_Pos)
#define TC_INTFLAG_MC0_Msk (_U_(0x1) << TC_INTFLAG_MC0_Pos)
#define TC_INTFLAG_MC1_Msk (_U_(0x1) << TC_INTFLAG_MC1_Pos)
#define TC_STATUS_STOP_Msk (_U_(0x1) << TC_STATUS_STOP_Pos)
#define TC_STATUS_SLAVE_Msk (_U_(0x1) << TC_STATUS_SLAVE_Pos)
#define TC_STATUS_PERBUFV_Msk (_U_(0x1) << TC_STATUS_PERBUFV_Pos)
#define TC_STATUS_CCBUFV0_Msk (_U_(0x1) << TC_STATUS_CCBUFV0_Pos)
#define TC_STATUS_CCBUFV1_Msk (_U_(0x1) << TC_STATUS_CCBUFV1_Pos)
#define TC_DRVCTRL_INVEN0_Msk (_U_(0x1) << TC_DRVCTRL_INVEN0_Pos)
#define TC_DRVCTRL_INVEN1_Msk (_U_(0x1) << TC_DRVCTRL_INVEN1_Pos)
#define TC_SYNCBUSY_SWRST_Msk (_U_(0x1) << TC_SYNCBUSY_SWRST_Pos)
#define TC_SYNCBUSY_ENABLE_Msk (_U_(0x1) << TC_SYNCBUSY_ENABLE_Pos)
#define TC_SYNCBUSY_CTRLB_Msk (_U_(0x1) << TC_SYNCBUSY_CTRLB_Pos)
#define TC_SYNCBUSY_STATUS_Msk (_U_(0x1) << TC_SYNCBUSY_STATUS_Pos)
#define TC_SYNCBUSY_COUNT_Msk (_U_(0x1) << TC_SYNCBUSY_COUNT_Pos)
#define TC_SYNCBUSY_PER_Msk (_U_(0x1) << TC_SYNCBUSY_PER_Pos)
#define TC_SYNCBUSY_CC0_Msk (_U_(0x1) << TC_SYNCBUSY_CC0_Pos)
#define TC_SYNCBUSY_CC1_Msk (_U_(0x1) << TC_SYNCBUSY_CC1_Pos)
#define TC_CTRLA_Msk TC_CTRLA_MASK
#define TC_CTRLBCLR_Msk TC_CTRLBCLR_MASK
#define TC_CTRLBSET_Msk TC_CTRLBSET_MASK
#define TC_EVCTRL_Msk TC_EVCTRL_MASK
#define TC_INTENCLR_Msk TC_INTENCLR_MASK
#define TC_INTENSET_Msk TC_INTENSET_MASK
#define TC_INTFLAG_Msk TC_INTFLAG_MASK
#define TC_STATUS_Msk TC_STATUS_MASK
#define TC_WAVE_Msk TC_WAVE_MASK
#define TC_DRVCTRL_Msk TC_DRVCTRL_MASK
#define TC_SYNCBUSY_Msk TC_SYNCBUSY_MASK
#define TC_COUNT16_COUNT_Msk TC_COUNT16_COUNT_MASK
#define TC_COUNT32_COUNT_Msk TC_COUNT32_COUNT_MASK
#define TC_COUNT8_COUNT_Msk TC_COUNT8_COUNT_MASK
#define TC_COUNT8_PER_Msk TC_COUNT8_PER_MASK
#define TC_COUNT16_CC_Msk TC_COUNT16_CC_MASK
#define TC_COUNT32_CC_Msk TC_COUNT32_CC_MASK
#define TC_COUNT8_CC_Msk TC_COUNT8_CC_MASK
#define TC_COUNT8_PERBUF_Msk TC_COUNT8_PERBUF_MASK
#define TC_COUNT16_CCBUF_Msk TC_COUNT16_CCBUF_MASK
#define TC_COUNT32_CCBUF_Msk TC_COUNT32_CCBUF_MASK
#define TC_COUNT8_CCBUF_Msk TC_COUNT8_CCBUF_MASK
#define TCC_CTRLA_SWRST_Msk (_U_(0x1) << TCC_CTRLA_SWRST_Pos)
#define TCC_CTRLA_ENABLE_Msk (_U_(0x1) << TCC_CTRLA_ENABLE_Pos)
#define TCC_CTRLA_RUNSTDBY_Msk (_U_(0x1) << TCC_CTRLA_RUNSTDBY_Pos)
#define TCC_CTRLA_ALOCK_Msk (_U_(0x1) << TCC_CTRLA_ALOCK_Pos)
#define TCC_CTRLA_MSYNC_Msk (_U_(0x1) << TCC_CTRLA_MSYNC_Pos)
#define TCC_CTRLA_CPTEN0_Msk (_U_(0x1) << TCC_CTRLA_CPTEN0_Pos)
#define TCC_CTRLA_CPTEN1_Msk (_U_(0x1) << TCC_CTRLA_CPTEN1_Pos)
#define TCC_CTRLA_CPTEN2_Msk (_U_(0x1) << TCC_CTRLA_CPTEN2_Pos)
#define TCC_CTRLA_CPTEN3_Msk (_U_(0x1) << TCC_CTRLA_CPTEN3_Pos)
#define TCC_CTRLBCLR_DIR_Msk (_U_(0x1) << TCC_CTRLBCLR_DIR_Pos)
#define TCC_CTRLBCLR_LUPD_Msk (_U_(0x1) << TCC_CTRLBCLR_LUPD_Pos)
#define TCC_CTRLBCLR_ONESHOT_Msk (_U_(0x1) << TCC_CTRLBCLR_ONESHOT_Pos)
#define TCC_CTRLBSET_DIR_Msk (_U_(0x1) << TCC_CTRLBSET_DIR_Pos)
#define TCC_CTRLBSET_LUPD_Msk (_U_(0x1) << TCC_CTRLBSET_LUPD_Pos)
#define TCC_CTRLBSET_ONESHOT_Msk (_U_(0x1) << TCC_CTRLBSET_ONESHOT_Pos)
#define TCC_SYNCBUSY_SWRST_Msk (_U_(0x1) << TCC_SYNCBUSY_SWRST_Pos)
#define TCC_SYNCBUSY_ENABLE_Msk (_U_(0x1) << TCC_SYNCBUSY_ENABLE_Pos)
#define TCC_SYNCBUSY_CTRLB_Msk (_U_(0x1) << TCC_SYNCBUSY_CTRLB_Pos)
#define TCC_SYNCBUSY_STATUS_Msk (_U_(0x1) << TCC_SYNCBUSY_STATUS_Pos)
#define TCC_SYNCBUSY_COUNT_Msk (_U_(0x1) << TCC_SYNCBUSY_COUNT_Pos)
#define TCC_SYNCBUSY_PATT_Msk (_U_(0x1) << TCC_SYNCBUSY_PATT_Pos)
#define TCC_SYNCBUSY_WAVE_Msk (_U_(0x1) << TCC_SYNCBUSY_WAVE_Pos)
#define TCC_SYNCBUSY_PER_Msk (_U_(0x1) << TCC_SYNCBUSY_PER_Pos)
#define TCC_SYNCBUSY_CC0_Msk (_U_(0x1) << TCC_SYNCBUSY_CC0_Pos)
#define TCC_SYNCBUSY_CC1_Msk (_U_(0x1) << TCC_SYNCBUSY_CC1_Pos)
#define TCC_SYNCBUSY_CC2_Msk (_U_(0x1) << TCC_SYNCBUSY_CC2_Pos)
#define TCC_SYNCBUSY_CC3_Msk (_U_(0x1) << TCC_SYNCBUSY_CC3_Pos)
#define TCC_FCTRLA_KEEP_Msk (_U_(0x1) << TCC_FCTRLA_KEEP_Pos)
#define TCC_FCTRLA_QUAL_Msk (_U_(0x1) << TCC_FCTRLA_QUAL_Pos)
#define TCC_FCTRLA_RESTART_Msk (_U_(0x1) << TCC_FCTRLA_RESTART_Pos)
#define TCC_FCTRLA_BLANKPRESC_Msk (_U_(0x1) << TCC_FCTRLA_BLANKPRESC_Pos)
#define TCC_FCTRLB_KEEP_Msk (_U_(0x1) << TCC_FCTRLB_KEEP_Pos)
#define TCC_FCTRLB_QUAL_Msk (_U_(0x1) << TCC_FCTRLB_QUAL_Pos)
#define TCC_FCTRLB_RESTART_Msk (_U_(0x1) << TCC_FCTRLB_RESTART_Pos)
#define TCC_FCTRLB_BLANKPRESC_Msk (_U_(0x1) << TCC_FCTRLB_BLANKPRESC_Pos)
#define TCC_WEXCTRL_DTIEN0_Msk (_U_(0x1) << TCC_WEXCTRL_DTIEN0_Pos)
#define TCC_WEXCTRL_DTIEN1_Msk (_U_(0x1) << TCC_WEXCTRL_DTIEN1_Pos)
#define TCC_WEXCTRL_DTIEN2_Msk (_U_(0x1) << TCC_WEXCTRL_DTIEN2_Pos)
#define TCC_WEXCTRL_DTIEN3_Msk (_U_(0x1) << TCC_WEXCTRL_DTIEN3_Pos)
#define TCC_DRVCTRL_NRE0_Msk (_U_(0x1) << TCC_DRVCTRL_NRE0_Pos)
#define TCC_DRVCTRL_NRE1_Msk (_U_(0x1) << TCC_DRVCTRL_NRE1_Pos)
#define TCC_DRVCTRL_NRE2_Msk (_U_(0x1) << TCC_DRVCTRL_NRE2_Pos)
#define TCC_DRVCTRL_NRE3_Msk (_U_(0x1) << TCC_DRVCTRL_NRE3_Pos)
#define TCC_DRVCTRL_NRE4_Msk (_U_(0x1) << TCC_DRVCTRL_NRE4_Pos)
#define TCC_DRVCTRL_NRE5_Msk (_U_(0x1) << TCC_DRVCTRL_NRE5_Pos)
#define TCC_DRVCTRL_NRE6_Msk (_U_(0x1) << TCC_DRVCTRL_NRE6_Pos)
#define TCC_DRVCTRL_NRE7_Msk (_U_(0x1) << TCC_DRVCTRL_NRE7_Pos)
#define TCC_DRVCTRL_NRV0_Msk (_U_(0x1) << TCC_DRVCTRL_NRV0_Pos)
#define TCC_DRVCTRL_NRV1_Msk (_U_(0x1) << TCC_DRVCTRL_NRV1_Pos)
#define TCC_DRVCTRL_NRV2_Msk (_U_(0x1) << TCC_DRVCTRL_NRV2_Pos)
#define TCC_DRVCTRL_NRV3_Msk (_U_(0x1) << TCC_DRVCTRL_NRV3_Pos)
#define TCC_DRVCTRL_NRV4_Msk (_U_(0x1) << TCC_DRVCTRL_NRV4_Pos)
#define TCC_DRVCTRL_NRV5_Msk (_U_(0x1) << TCC_DRVCTRL_NRV5_Pos)
#define TCC_DRVCTRL_NRV6_Msk (_U_(0x1) << TCC_DRVCTRL_NRV6_Pos)
#define TCC_DRVCTRL_NRV7_Msk (_U_(0x1) << TCC_DRVCTRL_NRV7_Pos)
#define TCC_DRVCTRL_INVEN0_Msk (_U_(0x1) << TCC_DRVCTRL_INVEN0_Pos)
#define TCC_DRVCTRL_INVEN1_Msk (_U_(0x1) << TCC_DRVCTRL_INVEN1_Pos)
#define TCC_DRVCTRL_INVEN2_Msk (_U_(0x1) << TCC_DRVCTRL_INVEN2_Pos)
#define TCC_DRVCTRL_INVEN3_Msk (_U_(0x1) << TCC_DRVCTRL_INVEN3_Pos)
#define TCC_DRVCTRL_INVEN4_Msk (_U_(0x1) << TCC_DRVCTRL_INVEN4_Pos)
#define TCC_DRVCTRL_INVEN5_Msk (_U_(0x1) << TCC_DRVCTRL_INVEN5_Pos)
#define TCC_DRVCTRL_INVEN6_Msk (_U_(0x1) << TCC_DRVCTRL_INVEN6_Pos)
#define TCC_DRVCTRL_INVEN7_Msk (_U_(0x1) << TCC_DRVCTRL_INVEN7_Pos)
#define TCC_DBGCTRL_DBGRUN_Msk (_U_(0x1) << TCC_DBGCTRL_DBGRUN_Pos)
#define TCC_DBGCTRL_FDDBD_Msk (_U_(0x1) << TCC_DBGCTRL_FDDBD_Pos)
#define TCC_EVCTRL_OVFEO_Msk (_U_(0x1) << TCC_EVCTRL_OVFEO_Pos)
#define TCC_EVCTRL_TRGEO_Msk (_U_(0x1) << TCC_EVCTRL_TRGEO_Pos)
#define TCC_EVCTRL_CNTEO_Msk (_U_(0x1) << TCC_EVCTRL_CNTEO_Pos)
#define TCC_EVCTRL_TCINV0_Msk (_U_(0x1) << TCC_EVCTRL_TCINV0_Pos)
#define TCC_EVCTRL_TCINV1_Msk (_U_(0x1) << TCC_EVCTRL_TCINV1_Pos)
#define TCC_EVCTRL_TCEI0_Msk (_U_(0x1) << TCC_EVCTRL_TCEI0_Pos)
#define TCC_EVCTRL_TCEI1_Msk (_U_(0x1) << TCC_EVCTRL_TCEI1_Pos)
#define TCC_EVCTRL_MCEI0_Msk (_U_(0x1) << TCC_EVCTRL_MCEI0_Pos)
#define TCC_EVCTRL_MCEI1_Msk (_U_(0x1) << TCC_EVCTRL_MCEI1_Pos)
#define TCC_EVCTRL_MCEI2_Msk (_U_(0x1) << TCC_EVCTRL_MCEI2_Pos)
#define TCC_EVCTRL_MCEI3_Msk (_U_(0x1) << TCC_EVCTRL_MCEI3_Pos)
#define TCC_EVCTRL_MCEO0_Msk (_U_(0x1) << TCC_EVCTRL_MCEO0_Pos)
#define TCC_EVCTRL_MCEO1_Msk (_U_(0x1) << TCC_EVCTRL_MCEO1_Pos)
#define TCC_EVCTRL_MCEO2_Msk (_U_(0x1) << TCC_EVCTRL_MCEO2_Pos)
#define TCC_EVCTRL_MCEO3_Msk (_U_(0x1) << TCC_EVCTRL_MCEO3_Pos)
#define TCC_INTENCLR_OVF_Msk (_U_(0x1) << TCC_INTENCLR_OVF_Pos)
#define TCC_INTENCLR_TRG_Msk (_U_(0x1) << TCC_INTENCLR_TRG_Pos)
#define TCC_INTENCLR_CNT_Msk (_U_(0x1) << TCC_INTENCLR_CNT_Pos)
#define TCC_INTENCLR_ERR_Msk (_U_(0x1) << TCC_INTENCLR_ERR_Pos)
#define TCC_INTENCLR_UFS_Msk (_U_(0x1) << TCC_INTENCLR_UFS_Pos)
#define TCC_INTENCLR_DFS_Msk (_U_(0x1) << TCC_INTENCLR_DFS_Pos)
#define TCC_INTENCLR_FAULTA_Msk (_U_(0x1) << TCC_INTENCLR_FAULTA_Pos)
#define TCC_INTENCLR_FAULTB_Msk (_U_(0x1) << TCC_INTENCLR_FAULTB_Pos)
#define TCC_INTENCLR_FAULT0_Msk (_U_(0x1) << TCC_INTENCLR_FAULT0_Pos)
#define TCC_INTENCLR_FAULT1_Msk (_U_(0x1) << TCC_INTENCLR_FAULT1_Pos)
#define TCC_INTENCLR_MC0_Msk (_U_(0x1) << TCC_INTENCLR_MC0_Pos)
#define TCC_INTENCLR_MC1_Msk (_U_(0x1) << TCC_INTENCLR_MC1_Pos)
#define TCC_INTENCLR_MC2_Msk (_U_(0x1) << TCC_INTENCLR_MC2_Pos)
#define TCC_INTENCLR_MC3_Msk (_U_(0x1) << TCC_INTENCLR_MC3_Pos)
#define TCC_INTENSET_OVF_Msk (_U_(0x1) << TCC_INTENSET_OVF_Pos)
#define TCC_INTENSET_TRG_Msk (_U_(0x1) << TCC_INTENSET_TRG_Pos)
#define TCC_INTENSET_CNT_Msk (_U_(0x1) << TCC_INTENSET_CNT_Pos)
#define TCC_INTENSET_ERR_Msk (_U_(0x1) << TCC_INTENSET_ERR_Pos)
#define TCC_INTENSET_UFS_Msk (_U_(0x1) << TCC_INTENSET_UFS_Pos)
#define TCC_INTENSET_DFS_Msk (_U_(0x1) << TCC_INTENSET_DFS_Pos)
#define TCC_INTENSET_FAULTA_Msk (_U_(0x1) << TCC_INTENSET_FAULTA_Pos)
#define TCC_INTENSET_FAULTB_Msk (_U_(0x1) << TCC_INTENSET_FAULTB_Pos)
#define TCC_INTENSET_FAULT0_Msk (_U_(0x1) << TCC_INTENSET_FAULT0_Pos)
#define TCC_INTENSET_FAULT1_Msk (_U_(0x1) << TCC_INTENSET_FAULT1_Pos)
#define TCC_INTENSET_MC0_Msk (_U_(0x1) << TCC_INTENSET_MC0_Pos)
#define TCC_INTENSET_MC1_Msk (_U_(0x1) << TCC_INTENSET_MC1_Pos)
#define TCC_INTENSET_MC2_Msk (_U_(0x1) << TCC_INTENSET_MC2_Pos)
#define TCC_INTENSET_MC3_Msk (_U_(0x1) << TCC_INTENSET_MC3_Pos)
#define TCC_INTFLAG_OVF_Msk (_U_(0x1) << TCC_INTFLAG_OVF_Pos)
#define TCC_INTFLAG_TRG_Msk (_U_(0x1) << TCC_INTFLAG_TRG_Pos)
#define TCC_INTFLAG_CNT_Msk (_U_(0x1) << TCC_INTFLAG_CNT_Pos)
#define TCC_INTFLAG_ERR_Msk (_U_(0x1) << TCC_INTFLAG_ERR_Pos)
#define TCC_INTFLAG_UFS_Msk (_U_(0x1) << TCC_INTFLAG_UFS_Pos)
#define TCC_INTFLAG_DFS_Msk (_U_(0x1) << TCC_INTFLAG_DFS_Pos)
#define TCC_INTFLAG_FAULTA_Msk (_U_(0x1) << TCC_INTFLAG_FAULTA_Pos)
#define TCC_INTFLAG_FAULTB_Msk (_U_(0x1) << TCC_INTFLAG_FAULTB_Pos)
#define TCC_INTFLAG_FAULT0_Msk (_U_(0x1) << TCC_INTFLAG_FAULT0_Pos)
#define TCC_INTFLAG_FAULT1_Msk (_U_(0x1) << TCC_INTFLAG_FAULT1_Pos)
#define TCC_INTFLAG_MC0_Msk (_U_(0x1) << TCC_INTFLAG_MC0_Pos)
#define TCC_INTFLAG_MC1_Msk (_U_(0x1) << TCC_INTFLAG_MC1_Pos)
#define TCC_INTFLAG_MC2_Msk (_U_(0x1) << TCC_INTFLAG_MC2_Pos)
#define TCC_INTFLAG_MC3_Msk (_U_(0x1) << TCC_INTFLAG_MC3_Pos)
#define TCC_STATUS_STOP_Msk (_U_(0x1) << TCC_STATUS_STOP_Pos)
#define TCC_STATUS_IDX_Msk (_U_(0x1) << TCC_STATUS_IDX_Pos)
#define TCC_STATUS_UFS_Msk (_U_(0x1) << TCC_STATUS_UFS_Pos)
#define TCC_STATUS_DFS_Msk (_U_(0x1) << TCC_STATUS_DFS_Pos)
#define TCC_STATUS_SLAVE_Msk (_U_(0x1) << TCC_STATUS_SLAVE_Pos)
#define TCC_STATUS_PATTBUFV_Msk (_U_(0x1) << TCC_STATUS_PATTBUFV_Pos)
#define TCC_STATUS_WAVEBUFV_Msk (_U_(0x1) << TCC_STATUS_WAVEBUFV_Pos)
#define TCC_STATUS_PERBUFV_Msk (_U_(0x1) << TCC_STATUS_PERBUFV_Pos)
#define TCC_STATUS_FAULTAIN_Msk (_U_(0x1) << TCC_STATUS_FAULTAIN_Pos)
#define TCC_STATUS_FAULTBIN_Msk (_U_(0x1) << TCC_STATUS_FAULTBIN_Pos)
#define TCC_STATUS_FAULT0IN_Msk (_U_(0x1) << TCC_STATUS_FAULT0IN_Pos)
#define TCC_STATUS_FAULT1IN_Msk (_U_(0x1) << TCC_STATUS_FAULT1IN_Pos)
#define TCC_STATUS_FAULTA_Msk (_U_(0x1) << TCC_STATUS_FAULTA_Pos)
#define TCC_STATUS_FAULTB_Msk (_U_(0x1) << TCC_STATUS_FAULTB_Pos)
#define TCC_STATUS_FAULT0_Msk (_U_(0x1) << TCC_STATUS_FAULT0_Pos)
#define TCC_STATUS_FAULT1_Msk (_U_(0x1) << TCC_STATUS_FAULT1_Pos)
#define TCC_STATUS_CCBUFV0_Msk (_U_(0x1) << TCC_STATUS_CCBUFV0_Pos)
#define TCC_STATUS_CCBUFV1_Msk (_U_(0x1) << TCC_STATUS_CCBUFV1_Pos)
#define TCC_STATUS_CCBUFV2_Msk (_U_(0x1) << TCC_STATUS_CCBUFV2_Pos)
#define TCC_STATUS_CCBUFV3_Msk (_U_(0x1) << TCC_STATUS_CCBUFV3_Pos)
#define TCC_STATUS_CMP0_Msk (_U_(0x1) << TCC_STATUS_CMP0_Pos)
#define TCC_STATUS_CMP1_Msk (_U_(0x1) << TCC_STATUS_CMP1_Pos)
#define TCC_STATUS_CMP2_Msk (_U_(0x1) << TCC_STATUS_CMP2_Pos)
#define TCC_STATUS_CMP3_Msk (_U_(0x1) << TCC_STATUS_CMP3_Pos)
#define TCC_PATT_PGE0_Msk (_U_(0x1) << TCC_PATT_PGE0_Pos)
#define TCC_PATT_PGE1_Msk (_U_(0x1) << TCC_PATT_PGE1_Pos)
#define TCC_PATT_PGE2_Msk (_U_(0x1) << TCC_PATT_PGE2_Pos)
#define TCC_PATT_PGE3_Msk (_U_(0x1) << TCC_PATT_PGE3_Pos)
#define TCC_PATT_PGE4_Msk (_U_(0x1) << TCC_PATT_PGE4_Pos)
#define TCC_PATT_PGE5_Msk (_U_(0x1) << TCC_PATT_PGE5_Pos)
#define TCC_PATT_PGE6_Msk (_U_(0x1) << TCC_PATT_PGE6_Pos)
#define TCC_PATT_PGE7_Msk (_U_(0x1) << TCC_PATT_PGE7_Pos)
#define TCC_PATT_PGV0_Msk (_U_(0x1) << TCC_PATT_PGV0_Pos)
#define TCC_PATT_PGV1_Msk (_U_(0x1) << TCC_PATT_PGV1_Pos)
#define TCC_PATT_PGV2_Msk (_U_(0x1) << TCC_PATT_PGV2_Pos)
#define TCC_PATT_PGV3_Msk (_U_(0x1) << TCC_PATT_PGV3_Pos)
#define TCC_PATT_PGV4_Msk (_U_(0x1) << TCC_PATT_PGV4_Pos)
#define TCC_PATT_PGV5_Msk (_U_(0x1) << TCC_PATT_PGV5_Pos)
#define TCC_PATT_PGV6_Msk (_U_(0x1) << TCC_PATT_PGV6_Pos)
#define TCC_PATT_PGV7_Msk (_U_(0x1) << TCC_PATT_PGV7_Pos)
#define TCC_WAVE_CIPEREN_Msk (_U_(0x1) << TCC_WAVE_CIPEREN_Pos)
#define TCC_WAVE_CICCEN0_Msk (_U_(0x1) << TCC_WAVE_CICCEN0_Pos)
#define TCC_WAVE_CICCEN1_Msk (_U_(0x1) << TCC_WAVE_CICCEN1_Pos)
#define TCC_WAVE_CICCEN2_Msk (_U_(0x1) << TCC_WAVE_CICCEN2_Pos)
#define TCC_WAVE_CICCEN3_Msk (_U_(0x1) << TCC_WAVE_CICCEN3_Pos)
#define TCC_WAVE_POL0_Msk (_U_(0x1) << TCC_WAVE_POL0_Pos)
#define TCC_WAVE_POL1_Msk (_U_(0x1) << TCC_WAVE_POL1_Pos)
#define TCC_WAVE_POL2_Msk (_U_(0x1) << TCC_WAVE_POL2_Pos)
#define TCC_WAVE_POL3_Msk (_U_(0x1) << TCC_WAVE_POL3_Pos)
#define TCC_WAVE_SWAP0_Msk (_U_(0x1) << TCC_WAVE_SWAP0_Pos)
#define TCC_WAVE_SWAP1_Msk (_U_(0x1) << TCC_WAVE_SWAP1_Pos)
#define TCC_WAVE_SWAP2_Msk (_U_(0x1) << TCC_WAVE_SWAP2_Pos)
#define TCC_WAVE_SWAP3_Msk (_U_(0x1) << TCC_WAVE_SWAP3_Pos)
#define TCC_PATTBUF_PGEB0_Msk (_U_(0x1) << TCC_PATTBUF_PGEB0_Pos)
#define TCC_PATTBUF_PGEB1_Msk (_U_(0x1) << TCC_PATTBUF_PGEB1_Pos)
#define TCC_PATTBUF_PGEB2_Msk (_U_(0x1) << TCC_PATTBUF_PGEB2_Pos)
#define TCC_PATTBUF_PGEB3_Msk (_U_(0x1) << TCC_PATTBUF_PGEB3_Pos)
#define TCC_PATTBUF_PGEB4_Msk (_U_(0x1) << TCC_PATTBUF_PGEB4_Pos)
#define TCC_PATTBUF_PGEB5_Msk (_U_(0x1) << TCC_PATTBUF_PGEB5_Pos)
#define TCC_PATTBUF_PGEB6_Msk (_U_(0x1) << TCC_PATTBUF_PGEB6_Pos)
#define TCC_PATTBUF_PGEB7_Msk (_U_(0x1) << TCC_PATTBUF_PGEB7_Pos)
#define TCC_PATTBUF_PGVB0_Msk (_U_(0x1) << TCC_PATTBUF_PGVB0_Pos)
#define TCC_PATTBUF_PGVB1_Msk (_U_(0x1) << TCC_PATTBUF_PGVB1_Pos)
#define TCC_PATTBUF_PGVB2_Msk (_U_(0x1) << TCC_PATTBUF_PGVB2_Pos)
#define TCC_PATTBUF_PGVB3_Msk (_U_(0x1) << TCC_PATTBUF_PGVB3_Pos)
#define TCC_PATTBUF_PGVB4_Msk (_U_(0x1) << TCC_PATTBUF_PGVB4_Pos)
#define TCC_PATTBUF_PGVB5_Msk (_U_(0x1) << TCC_PATTBUF_PGVB5_Pos)
#define TCC_PATTBUF_PGVB6_Msk (_U_(0x1) << TCC_PATTBUF_PGVB6_Pos)
#define TCC_PATTBUF_PGVB7_Msk (_U_(0x1) << TCC_PATTBUF_PGVB7_Pos)
#define TCC_WAVEBUF_CIPERENB_Msk (_U_(0x1) << TCC_WAVEBUF_CIPERENB_Pos)
#define TCC_WAVEBUF_CICCENB0_Msk (_U_(0x1) << TCC_WAVEBUF_CICCENB0_Pos)
#define TCC_WAVEBUF_CICCENB1_Msk (_U_(0x1) << TCC_WAVEBUF_CICCENB1_Pos)
#define TCC_WAVEBUF_CICCENB2_Msk (_U_(0x1) << TCC_WAVEBUF_CICCENB2_Pos)
#define TCC_WAVEBUF_CICCENB3_Msk (_U_(0x1) << TCC_WAVEBUF_CICCENB3_Pos)
#define TCC_WAVEBUF_POLB0_Msk (_U_(0x1) << TCC_WAVEBUF_POLB0_Pos)
#define TCC_WAVEBUF_POLB1_Msk (_U_(0x1) << TCC_WAVEBUF_POLB1_Pos)
#define TCC_WAVEBUF_POLB2_Msk (_U_(0x1) << TCC_WAVEBUF_POLB2_Pos)
#define TCC_WAVEBUF_POLB3_Msk (_U_(0x1) << TCC_WAVEBUF_POLB3_Pos)
#define TCC_WAVEBUF_SWAPB0_Msk (_U_(0x1) << TCC_WAVEBUF_SWAPB0_Pos)
#define TCC_WAVEBUF_SWAPB1_Msk (_U_(0x1) << TCC_WAVEBUF_SWAPB1_Pos)
#define TCC_WAVEBUF_SWAPB2_Msk (_U_(0x1) << TCC_WAVEBUF_SWAPB2_Pos)
#define TCC_WAVEBUF_SWAPB3_Msk (_U_(0x1) << TCC_WAVEBUF_SWAPB3_Pos)
#define TCC_CTRLA_Msk TCC_CTRLA_MASK
#define TCC_CTRLBCLR_Msk TCC_CTRLBCLR_MASK
#define TCC_CTRLBSET_Msk TCC_CTRLBSET_MASK
#define TCC_SYNCBUSY_Msk TCC_SYNCBUSY_MASK
#define TCC_FCTRLA_Msk TCC_FCTRLA_MASK
#define TCC_FCTRLB_Msk TCC_FCTRLB_MASK
#define TCC_WEXCTRL_Msk TCC_WEXCTRL_MASK
#define TCC_DRVCTRL_Msk TCC_DRVCTRL_MASK
#define TCC_DBGCTRL_Msk TCC_DBGCTRL_MASK
#define TCC_EVCTRL_Msk TCC_EVCTRL_MASK
#define TCC_INTENCLR_Msk TCC_INTENCLR_MASK
#define TCC_INTENSET_Msk TCC_INTENSET_MASK
#define TCC_INTFLAG_Msk TCC_INTFLAG_MASK
#define TCC_STATUS_Msk TCC_STATUS_MASK
#define TCC_COUNT_DITH4_Msk TCC_COUNT_DITH4_MASK
#define TCC_COUNT_DITH5_Msk TCC_COUNT_DITH5_MASK
#define TCC_COUNT_DITH6_Msk TCC_COUNT_DITH6_MASK
#define TCC_COUNT_Msk TCC_COUNT_MASK
#define TCC_PATT_Msk TCC_PATT_MASK
#define TCC_WAVE_Msk TCC_WAVE_MASK
#define TCC_PER_DITH4_Msk TCC_PER_DITH4_MASK
#define TCC_PER_DITH5_Msk TCC_PER_DITH5_MASK
#define TCC_PER_DITH6_Msk TCC_PER_DITH6_MASK
#define TCC_PER_Msk TCC_PER_MASK
#define TCC_CC_DITH4_Msk TCC_CC_DITH4_MASK
#define TCC_CC_DITH5_Msk TCC_CC_DITH5_MASK
#define TCC_CC_DITH6_Msk TCC_CC_DITH6_MASK
#define TCC_CC_Msk TCC_CC_MASK
#define TCC_PATTBUF_Msk TCC_PATTBUF_MASK
#define TCC_WAVEBUF_Msk TCC_WAVEBUF_MASK
#define TCC_PERBUF_DITH4_Msk TCC_PERBUF_DITH4_MASK
#define TCC_PERBUF_DITH5_Msk TCC_PERBUF_DITH5_MASK
#define TCC_PERBUF_DITH6_Msk TCC_PERBUF_DITH6_MASK
#define TCC_PERBUF_Msk TCC_PERBUF_MASK
#define TCC_CCBUF_DITH4_Msk TCC_CCBUF_DITH4_MASK
#define TCC_CCBUF_DITH5_Msk TCC_CCBUF_DITH5_MASK
#define TCC_CCBUF_DITH6_Msk TCC_CCBUF_DITH6_MASK
#define TCC_CCBUF_Msk TCC_CCBUF_MASK
#define TRNG_CTRLA_ENABLE_Msk (_U_(0x1) << TRNG_CTRLA_ENABLE_Pos)
#define TRNG_CTRLA_RUNSTDBY_Msk (_U_(0x1) << TRNG_CTRLA_RUNSTDBY_Pos)
#define TRNG_EVCTRL_DATARDYEO_Msk (_U_(0x1) << TRNG_EVCTRL_DATARDYEO_Pos)
#define TRNG_INTENCLR_DATARDY_Msk (_U_(0x1) << TRNG_INTENCLR_DATARDY_Pos)
#define TRNG_INTENSET_DATARDY_Msk (_U_(0x1) << TRNG_INTENSET_DATARDY_Pos)
#define TRNG_INTFLAG_DATARDY_Msk (_U_(0x1) << TRNG_INTFLAG_DATARDY_Pos)
#define TRNG_CTRLA_Msk TRNG_CTRLA_MASK
#define TRNG_EVCTRL_Msk TRNG_EVCTRL_MASK
#define TRNG_INTENCLR_Msk TRNG_INTENCLR_MASK
#define TRNG_INTENSET_Msk TRNG_INTENSET_MASK
#define TRNG_INTFLAG_Msk TRNG_INTFLAG_MASK
#define TRNG_DATA_Msk TRNG_DATA_MASK
#define USB_CTRLA_SWRST_Msk (_U_(0x1) << USB_CTRLA_SWRST_Pos)
#define USB_CTRLA_ENABLE_Msk (_U_(0x1) << USB_CTRLA_ENABLE_Pos)
#define USB_CTRLA_RUNSTDBY_Msk (_U_(0x1) << USB_CTRLA_RUNSTDBY_Pos)
#define USB_CTRLA_MODE_Msk (_U_(0x1) << USB_CTRLA_MODE_Pos)
#define USB_SYNCBUSY_SWRST_Msk (_U_(0x1) << USB_SYNCBUSY_SWRST_Pos)
#define USB_SYNCBUSY_ENABLE_Msk (_U_(0x1) << USB_SYNCBUSY_ENABLE_Pos)
#define USB_DEVICE_CTRLB_DETACH_Msk (_U_(0x1) << USB_DEVICE_CTRLB_DETACH_Pos)
#define USB_DEVICE_CTRLB_UPRSM_Msk (_U_(0x1) << USB_DEVICE_CTRLB_UPRSM_Pos)
#define USB_DEVICE_CTRLB_NREPLY_Msk (_U_(0x1) << USB_DEVICE_CTRLB_NREPLY_Pos)
#define USB_DEVICE_CTRLB_TSTJ_Msk (_U_(0x1) << USB_DEVICE_CTRLB_TSTJ_Pos)
#define USB_DEVICE_CTRLB_TSTK_Msk (_U_(0x1) << USB_DEVICE_CTRLB_TSTK_Pos)
#define USB_DEVICE_CTRLB_TSTPCKT_Msk (_U_(0x1) << USB_DEVICE_CTRLB_TSTPCKT_Pos)
#define USB_DEVICE_CTRLB_OPMODE2_Msk (_U_(0x1) << USB_DEVICE_CTRLB_OPMODE2_Pos)
#define USB_DEVICE_CTRLB_GNAK_Msk (_U_(0x1) << USB_DEVICE_CTRLB_GNAK_Pos)
#define USB_HOST_CTRLB_RESUME_Msk (_U_(0x1) << USB_HOST_CTRLB_RESUME_Pos)
#define USB_HOST_CTRLB_AUTORESUME_Msk (_U_(0x1) << USB_HOST_CTRLB_AUTORESUME_Pos)
#define USB_HOST_CTRLB_TSTJ_Msk (_U_(0x1) << USB_HOST_CTRLB_TSTJ_Pos)
#define USB_HOST_CTRLB_TSTK_Msk (_U_(0x1) << USB_HOST_CTRLB_TSTK_Pos)
#define USB_HOST_CTRLB_SOFE_Msk (_U_(0x1) << USB_HOST_CTRLB_SOFE_Pos)
#define USB_HOST_CTRLB_BUSRESET_Msk (_U_(0x1) << USB_HOST_CTRLB_BUSRESET_Pos)
#define USB_HOST_CTRLB_VBUSOK_Msk (_U_(0x1) << USB_HOST_CTRLB_VBUSOK_Pos)
#define USB_HOST_CTRLB_L1RESUME_Msk (_U_(0x1) << USB_HOST_CTRLB_L1RESUME_Pos)
#define USB_DEVICE_DADD_ADDEN_Msk (_U_(0x1) << USB_DEVICE_DADD_ADDEN_Pos)
#define USB_HOST_HSOFC_FLENCE_Msk (_U_(0x1) << USB_HOST_HSOFC_FLENCE_Pos)
#define USB_DEVICE_FNUM_FNCERR_Msk (_U_(0x1) << USB_DEVICE_FNUM_FNCERR_Pos)
#define USB_DEVICE_INTENCLR_SUSPEND_Msk (_U_(0x1) << USB_DEVICE_INTENCLR_SUSPEND_Pos)
